#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ПометкаУдаления
		Или Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"Справочник.EBC_Пользователи");
	ЭлементБлокировки.УстановитьЗначение(
		"Пользователь",
		Пользователь);
	ЭлементБлокировки.Режим =
		РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		| ПользователиEBC.Ссылка КАК Ссылка
		|ИЗ
		| Справочник.EBC_Пользователи КАК ПользователиEBC
		|ГДЕ
		| ПользователиEBC.Пользователь = &Пользователь
		| И НЕ ПользователиEBC.ПометкаУдаления
		| И ПользователиEBC.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВызватьИсключение "Неоднозначное сопоставление пользователя Easy Busy Chat.";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
