#Область ОписаниеПеременных

Перем глКомпонентаEBC Экспорт;
Перем глПутьКФайлуКомпонентыEBC Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаВнешнегоСобытия")
Процедура EBC_ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	EBC_ВебПлагин.ОбработатьВнешнееСобытие(
		Источник,
		Событие,
		Данные,
		глКомпонентаEBC);

КонецПроцедуры

&После("ПередЗавершениемРаботыСистемы")
Процедура EBC_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)

	Если Не Отказ Тогда
		EBC_ВебПлагин.ЗакрытьКомпоненту(глКомпонентаEBC);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
