#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСписок(Команда)

	Результат = ЗагрузитьСписокНаСервере();
	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(
			НСтр(
				"ru = 'Синхронизация пользователей Easy Busy Chat';
				|uk = 'Синхронізація користувачів Easy Busy Chat'"),
			,
			СтрШаблон(
				НСтр(
					"ru = 'Загружено или обновлено пользователей: %1';
					|uk = 'Завантажено або оновлено користувачів: %1'"),
				Результат.Количество));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр(
					"ru = 'Пользователи загружены с ошибками. Обработано: %1. %2';
					|uk = 'Користувачів завантажено з помилками. Оброблено: %1. %2'"),
				Результат.Количество,
				Результат.Ошибка));
	КонецЕсли;

	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьСписокНаСервере()
	Возврат EBC_Ядро.ЗагрузитьПользователей();
КонецФункции

#КонецОбласти
