#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗагрузитьСписок(Команда)

	Результат = ЗагрузитьСписокНаСервере();
	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(
			НСтр(
				"ru = 'Синхронизация структуры Easy Busy Chat';
				|uk = 'Синхронізація структури Easy Busy Chat'"),
			,
			СтрШаблон(
				НСтр(
					"ru = 'Компаний: %1, учетных записей: %2';
					|uk = 'Компаній: %1, облікових записів: %2'"),
				Результат.КоличествоКомпаний,
				Результат.КоличествоУчетныхЗаписей));
		Элементы.Список.Обновить();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			Результат.Ошибка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьСписокНаСервере()
	Возврат EBC_Ядро.СинхронизироватьСтруктуруКомпаний();
КонецФункции

#КонецОбласти